<div class='alert alert-info'>
    <h2>Agrupación categórica</h2>
</div>

In [1]:
import pandas as pd
import numpy as np
import random

In [2]:
gender = ['Male', 'Female']
income = ['Poor', 'Middel', 'Rich']

In [5]:
n = 500 # size dataframe

gender_data = []
income_data = []

for i in range(n):
    gender_data.append(np.random.choice(gender))
    income_data.append(np.random.choice(income))

In [14]:
# n = media + desviación * distribución
height = (160 + 30*np.random.randn(n)).astype(int)
weight = (65 + 25*np.random.randn(n)).astype(int)
age = (30 + 12*np.random.randn(n)).astype(int)
income = 18000 + 3500*np.random.randn(n)

In [36]:
data = pd.DataFrame(
    {
        'Gender': gender_data,
        'Economic Status': income_data,
        'Height': height,
        'Weight': weight,
        'Age': age,
        'Income': income
    }
)

data.head()

   Gender Economic Status  Height  Weight  Age        Income
0  Female          Middel     160      83   23  17312.678947
1  Female          Middel     166      51   24  12100.529134
2  Female            Poor     159      54   24  14444.572923
3    Male            Poor     202      61   35  16575.215988
4    Male            Rich     109      87   45  16250.030817

In [37]:
gruped_gender = data.groupby('Gender')

gruped_gender.groups

{'Female': Int64Index([  0,   1,   2,   6,   7,  10,  14,  16,  19,  22,
             ...
             474, 478, 479, 482, 485, 487, 488, 494, 498, 499],
            dtype='int64', length=248),
 'Male': Int64Index([  3,   4,   5,   8,   9,  11,  12,  13,  15,  17,
             ...
             484, 486, 489, 490, 491, 492, 493, 495, 496, 497],
            dtype='int64', length=252)}

In [38]:
for names, groups in gruped_gender:
    print(names)
    print(groups)

Female
     Gender Economic Status  Height  Weight  Age        Income
0    Female          Middel     160      83   23  17312.678947
1    Female          Middel     166      51   24  12100.529134
2    Female            Poor     159      54   24  14444.572923
6    Female            Poor     142      45   18  24587.492587
7    Female            Rich     146      18   27  22249.145797
10   Female          Middel     150      72   17  22263.405529
14   Female          Middel     130      70   24  17688.941119
16   Female            Poor     172      93   31  16404.788340
19   Female            Poor     194      54    6  23212.733780
22   Female          Middel     154      38   30  16788.489808
24   Female            Poor     213      67   14  19030.857070
25   Female          Middel     116     102   35  15381.094655
27   Female            Rich     200      67   29  14007.796624
31   Female            Poor     205      42   28  14894.362488
33   Female            Poor     153      11    1  23616.738272
37   Female            Rich     179      86   40  20241.900862
38   Female            Poor     166      40   -3  22909.961283
39   Female          Middel     212      91   54  22212.383058
40   Female            Poor     120      62   24  18050.508383
41   Female            Poor     179      86   39  20004.979274
42   Female            Rich     119      82   33  24360.228222
44   Female            Rich     202     120   17  18174.809386
45   Female            Rich     222      81   32  19441.476991
46   Female            Rich     147      63   18  22012.292005
47   Female            Poor     184      54   29  21068.212768
48   Female            Poor     130      91   37  18024.636536
49   Female          Middel     144     103   32  17995.882755
51   Female          Middel     163     105   18  20785.740154
53   Female            Poor     181      82   36  18144.333646
54   Female            Rich     180      41   51  16908.748161
..      ...             ...     ...     ...  ...           ...
430  Female            Rich     150      54   21  14020.796154
431  Female            Rich     114      59   34  21256.756900
432  Female            Poor     199     104   38  17665.186995
433  Female          Middel     200      85   25  15341.046810
435  Female            Rich     177      72   36  12787.760366
442  Female            Poor     156      48   32  25429.818662
443  Female            Rich     134      81   44  14822.296767
444  Female            Poor     155      45   34  24885.651769
445  Female          Middel     138      83   14  14264.850600
451  Female            Poor     127       1   23  16705.707637
452  Female            Rich     180      36   40  19537.686692
453  Female            Rich     134      45   36  20433.561570
455  Female          Middel     121      73    8  18687.911146
457  Female          Middel     173      74   38  14996.292221
458  Female          Middel     182      38   15  17901.589269
459  Female            Rich     120     117    9  19731.350438
461  Female          Middel     156      62   32  18252.446054
465  Female            Poor     143      83   10  19238.364872
468  Female            Poor     175      62   41  19552.948571
470  Female            Rich      88      55   25  22973.902544
474  Female            Poor      98      23   32  18486.297304
478  Female            Rich     136      56   31  10710.407610
479  Female          Middel     196      83   22  15526.531827
482  Female            Rich     222      37   35  17005.874139
485  Female          Middel     165      88   34  20716.946368
487  Female          Middel     144     100   44  19609.757259
488  Female          Middel     159      44   58  23773.331818
494  Female            Poor     138      71   28  21005.476363
498  Female            Poor     222      68   49  20431.951009
499  Female            Poor     111      40   46  22617.015163

[248 rows x 6 columns]
Male
    Gender Economic Status  Height  Weight  Age        Income
3     Male            Poor     202      61   35  16575.215988
4     Male            Rich     109      87   45  16250.030817
5     Male            Poor     149      48   32  22484.813747
8     Male            Rich     166      47   24  26047.165580
9     Male            Poor     121      54   42  20163.806684
11    Male            Poor     150      34   34  13885.342950
12    Male            Poor     140      32   27  22521.856991
13    Male            Poor     211      60   44  16183.699341
15    Male            Poor     144      70   30  15750.378446
17    Male          Middel     164      58   15  18295.613467
18    Male            Rich     155      34   25  17173.570850
20    Male            Poor     210      81   24  15569.199663
21    Male            Rich     126      84   41  17011.868118
23    Male          Middel     175      55   41  17737.517534
26    Male            Rich     163      34   34  18308.933251
28    Male            Rich     161      96    9  22479.397926
29    Male          Middel     169      79   39  18807.970359
30    Male            Poor     165      64   24  13412.519710
32    Male            Poor     186      51   29  14142.045646
34    Male            Rich     172      71   44  18089.170803
35    Male            Poor     184      58   37  20913.014215
36    Male          Middel     141     108   46  14050.468866
43    Male            Rich     143      64   26  17975.923631
50    Male          Middel     172     115   18  19052.401054
52    Male          Middel     186      69   22  25270.784563
57    Male            Rich     175      65   24  21827.260009
61    Male          Middel     146      10   33  14506.980083
62    Male            Poor     242      15   54  13014.549569
64    Male            Poor     140      72   39  15150.924323
65    Male          Middel     164      16   41  26125.879142
..     ...             ...     ...     ...  ...           ...
449   Male          Middel     156     -11   17  15855.785351
450   Male            Poor     191      63   35  17394.183971
454   Male            Poor     166      79   35  18313.453429
456   Male            Poor     149      52   15  18982.707851
460   Male          Middel     135      83   59  18536.007922
462   Male          Middel     147     105   32  17501.792349
463   Male          Middel     172      87   32  18732.436557
464   Male          Middel     171      49   13  18700.438888
466   Male          Middel     114      82   39  23608.341634
467   Male          Middel     172      35   40  20412.683149
469   Male            Poor     150      63   61  18386.961425
471   Male            Rich     143      78   12  12672.961847
472   Male          Middel     137      76    4  15583.613769
473   Male            Rich     185      74   36  16909.460945
475   Male          Middel     125      92   23  14001.217159
476   Male            Rich     208     117   11  16417.897302
477   Male            Rich     158      44   23  21715.688233
480   Male            Rich     117      66   30  21502.762168
481   Male          Middel     128      49   22  17303.690821
483   Male          Middel      81      65   40  21970.341860
484   Male            Poor     161      99   23  21990.818439
486   Male            Poor     198      73   39  17168.867420
489   Male            Rich     179      49    1   8268.539477
490   Male            Rich     148      62   39  22081.941248
491   Male          Middel     126      80   54  20903.059634
492   Male            Poor     130      50   21  11923.897949
493   Male          Middel     176      58   27  18205.034295
495   Male          Middel      85      76   27  16806.703863
496   Male          Middel     184      70   31  19908.478247
497   Male          Middel     171      64   18  14966.239613

[252 rows x 6 columns]

In [39]:
gruped_gender.get_group('Female').head()

   Gender Economic Status  Height  Weight  Age        Income
0  Female          Middel     160      83   23  17312.678947
1  Female          Middel     166      51   24  12100.529134
2  Female            Poor     159      54   24  14444.572923
6  Female            Poor     142      45   18  24587.492587
7  Female            Rich     146      18   27  22249.145797

## Doble agrupación

In [40]:
double = data.groupby(['Gender', 'Economic Status'])
for names, groups in double:
    print(names)

('Female', 'Middel')
('Female', 'Poor')
('Female', 'Rich')
('Male', 'Middel')
('Male', 'Poor')
('Male', 'Rich')

<div class='alert alert-success'>
    <h3>Operaciones sobre datos agrupados.</h3>
</div>

In [41]:
double.sum()

                        Height  Weight   Age        Income
Gender Economic Status
Female Middel            14288    5794  2518  1.604545e+06
       Poor              14280    5492  2544  1.648709e+06
       Rich              11248    4920  2033  1.299217e+06
Male   Middel            13881    5465  2590  1.606363e+06
       Poor              13238    4893  2510  1.436494e+06
       Rich              13291    5124  2286  1.488760e+06

In [42]:
double.mean()

                            Height     Weight        Age        Income
Gender Economic Status
Female Middel           162.363636  65.840909  28.613636  18233.470947
       Poor             162.272727  62.409091  28.909091  18735.324732
       Rich             156.222222  68.333333  28.236111  18044.677639
Male   Middel           155.966292  61.404494  29.101124  18049.021603
       Poor             161.439024  59.670732  30.609756  17518.220690
       Rich             164.086420  63.259259  28.222222  18379.753140

In [43]:
double.size()

Gender  Economic Status
Female  Middel             88
        Poor               88
        Rich               72
Male    Middel             89
        Poor               82
        Rich               81
dtype: int64

In [44]:
double.describe()

                       Height                                              \
                        count        mean        std    min    25%    50%
Gender Economic Status
Female Middel            88.0  162.363636  29.529328   85.0  144.0  160.5
       Poor              88.0  162.272727  30.650693   98.0  142.0  159.5
       Rich              72.0  156.222222  31.624212   88.0  134.0  151.0
Male   Middel            89.0  155.966292  32.397197   81.0  134.0  160.0
       Poor              82.0  161.439024  29.052145   90.0  140.5  162.5
       Rich              81.0  164.086420  31.252279  105.0  143.0  164.0

                                      Weight             ...    Age        \
                           75%    max  count       mean  ...    75%   max
Gender Economic Status                                   ...
Female Middel           180.00  271.0   88.0  65.840909  ...  35.25  59.0
       Poor             182.25  249.0   88.0  62.409091  ...  38.00  57.0
       Rich             174.50  227.0   72.0  68.333333  ...  38.25  51.0
Male   Middel           176.00  230.0   89.0  61.404494  ...  38.00  59.0
       Poor             179.75  242.0   82.0  59.670732  ...  37.00  61.0
       Rich             183.00  241.0   81.0  63.259259  ...  35.00  64.0

                       Income                                           \
                        count          mean          std           min
Gender Economic Status
Female Middel            88.0  18233.470947  3503.661987  10811.749454
       Poor              88.0  18735.324732  3085.826165  13294.290655
       Rich              72.0  18044.677639  3141.706671   9092.360747
Male   Middel            89.0  18049.021603  3205.779504  12756.260692
       Poor              82.0  17518.220690  3635.310892   8900.574916
       Rich              81.0  18379.753140  3695.448169   8050.933927


                                 25%           50%           75%           max
Gender Economic Status
Female Middel           15328.810546  18212.974498  20700.857184  25709.700045
       Poor             16380.802543  18184.503975  20949.684951  25586.887010
       Rich             16005.329993  18184.899155  19816.807384  24543.610375
Male   Middel           15374.416793  17737.650887  20023.206058  26125.879142
       Poor             14814.400684  17434.504040  19987.747501  25412.552108
       Rich             16417.897302  18175.276391  21122.508886  28030.778956

[6 rows x 32 columns]

In [45]:
gruped_income = double['Income']
gruped_income.describe()

                        count          mean          std           min  \
Gender Economic Status
Female Middel            88.0  18233.470947  3503.661987  10811.749454
       Poor              88.0  18735.324732  3085.826165  13294.290655
       Rich              72.0  18044.677639  3141.706671   9092.360747
Male   Middel            89.0  18049.021603  3205.779504  12756.260692
       Poor              82.0  17518.220690  3635.310892   8900.574916
       Rich              81.0  18379.753140  3695.448169   8050.933927

                                 25%           50%           75%           max
Gender Economic Status
Female Middel           15328.810546  18212.974498  20700.857184  25709.700045
       Poor             16380.802543  18184.503975  20949.684951  25586.887010
       Rich             16005.329993  18184.899155  19816.807384  24543.610375
Male   Middel           15374.416793  17737.650887  20023.206058  26125.879142
       Poor             14814.400684  17434.504040  19987.747501  25412.552108
       Rich             16417.897302  18175.276391  21122.508886  28030.778956

In [46]:
double.aggregate(
    {
        'Income': np.sum,
        'Age': np.mean,
        'Height': np.std
    }
)

                              Income        Age     Height
Gender Economic Status
Female Middel           1.604545e+06  28.613636  29.529328
       Poor             1.648709e+06  28.909091  30.650693
       Rich             1.299217e+06  28.236111  31.624212
Male   Middel           1.606363e+06  29.101124  32.397197
       Poor             1.436494e+06  30.609756  29.052145
       Rich             1.488760e+06  28.222222  31.252279

In [47]:
double.aggregate(
    {
        'Age': np.mean,
        'Height': lambda h: np.mean(h) / np.std(h)
    }
)

                              Age    Height
Gender Economic Status
Female Middel           28.613636  5.529895
       Poor             28.909091  5.324599
       Rich             28.236111  4.974623
Male   Middel           29.101124  4.841467
       Poor             30.609756  5.591068
       Rich             28.222222  5.283096

In [48]:
double.aggregate([np.sum, np.mean])

                       Height             Weight              Age             \
                          sum        mean    sum       mean   sum       mean
Gender Economic Status
Female Middel           14288  162.363636   5794  65.840909  2518  28.613636
       Poor             14280  162.272727   5492  62.409091  2544  28.909091
       Rich             11248  156.222222   4920  68.333333  2033  28.236111
Male   Middel           13881  155.966292   5465  61.404494  2590  29.101124
       Poor             13238  161.439024   4893  59.670732  2510  30.609756
       Rich             13291  164.086420   5124  63.259259  2286  28.222222

                              Income
                                 sum          mean
Gender Economic Status
Female Middel           1.604545e+06  18233.470947
       Poor             1.648709e+06  18735.324732
       Rich             1.299217e+06  18044.677639
Male   Middel           1.606363e+06  18049.021603
       Poor             1.436494e+06  17518.220690
       Rich             1.488760e+06  18379.753140

<div class='alert alert-success'>
    <h3>Filtrado de Datos.</h3>
</div>

In [53]:

double['Age'].filter(lambda x: x.sum() > 2400);

In [55]:
# Transformación
zscore = lambda h: np.mean(h) / np.std(h)
double.transform(zscore).head()

     Height    Weight       Age    Income
0  5.529895  2.657473  2.565251  5.233941
1  5.529895  2.657473  2.565251  5.233941
2  5.324599  2.514922  2.183531  6.106206
3  5.591068  2.511936  2.855963  4.848561
4  5.283096  2.489103  2.403941  5.004608